{
  "Apple___Apple_scab": "Spray fungicide (like mancozeb or captan) every 10 to 14 days in rainy season. Collect and burn fallen leaves. Do not water from the top.",
  "Apple___Black_rot": "Cut and throw away infected fruits and branches. Spray copper fungicide after pruning. Keep orchard clean and remove weeds.",
  "Apple___Cedar_apple_rust": "Do not plant near juniper trees. Remove infected leaves. Spray fungicide such as myclobutanil during early growth.",
  "Apple___healthy": "Tree is healthy. Keep soil fertile with compost, water regularly, and prune branches to keep airflow.",
  "Blueberry___healthy": "Plant is healthy. Mulch around the plant to keep moisture, water regularly, and protect from birds.",
  "Cherry_(including_sour)___Powdery_mildew": "White powder on leaves – spray sulfur-based fungicide every 7 to 10 days. Cut off diseased leaves and make space between trees.",
  "Cherry_(including_sour)___healthy": "Tree is fine. Give balanced fertilizer in spring and water deeply once a week.",
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "Plant resistant corn seeds. Rotate crops. Spray fungicide like strobilurin when first symptoms appear.",
  "Corn_(maize)___Common_rust_": "Grow rust-resistant seeds. Remove weeds. Spray fungicide such as azoxystrobin if disease spreads fast.",
  "Corn_(maize)___Northern_Leaf_Blight": "Use resistant hybrids. Rotate with non-corn crops. Spray fungicide at 6 to 8 leaf stage if infection is seen.",
  "Corn_(maize)___healthy": "Corn is healthy. Apply nitrogen fertilizer in stages and water during dry spells.",
  "Grape___Black_rot": "Remove infected leaves and grapes. Spray fungicide (captan, mancozeb) before and after flowering. Prune vines to increase airflow.",
  "Grape___Esca_(Black_Measles)": "Prune diseased wood. Avoid pruning wounds during rainy season. Apply protective fungicides after pruning.",
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Remove diseased leaves. Spray copper fungicide. Keep vineyard clean and free from weeds.",
  "Grape___healthy": "Plant is healthy. Fertilize with organic compost and water during dry season.",
  "Orange___Haunglongbing_(Citrus_greening)": "No full cure. Remove and destroy sick trees. Control psyllid insects with sprays. Plant resistant rootstocks if available.",
  "Peach___Bacterial_spot": "Spray copper fungicide after bloom. Use disease-free seeds or saplings. Avoid wetting leaves while watering.",
  "Peach___healthy": "Healthy tree. Water deeply once in 7 to 10 days and give potassium-rich fertilizer.",
  "Pepper,_bell___Bacterial_spot": "Use disease-free seeds. Spray copper fungicide weekly. Rotate crops and avoid planting peppers after tomatoes.",
  "Pepper,_bell___healthy": "Healthy crop. Give compost before flowering and maintain soil moisture.",
  "Potato___Early_blight": "Remove and destroy infected leaves. Spray fungicide (chlorothalonil, mancozeb) at first sign. Rotate crops with cereals.",
  "Potato___Late_blight": "Spray fungicide (metalaxyl or mancozeb) at 7-day intervals. Remove sick plants quickly. Avoid overhead irrigation.",
  "Potato___healthy": "Potato is fine. Plant certified seed tubers and hill soil around plants for protection.",
  "Raspberry___healthy": "Plant is healthy. Prune canes after harvest and remove weeds.",
  "Soybean___healthy": "Crop is healthy. Rotate crops, add nitrogen-fixing bacteria, and control weeds.",
  "Squash___Powdery_mildew": "White powdery spots – spray sulfur or neem oil. Plant resistant squash types. Give proper space between plants.",
  "Strawberry___Leaf_scorch": "Cut off infected leaves. Spray fungicide (captan). Water plants at soil level, not on leaves.",
  "Strawberry___healthy": "Healthy plant. Mulch with straw, keep weeds away, and water regularly.",
  "Tomato___Bacterial_spot": "Spray copper fungicide weekly. Avoid touching wet plants. Rotate crops every season.",
  "Tomato___Early_blight": "Remove yellowing leaves. Spray fungicide (mancozeb, chlorothalonil) at first signs. Rotate with non-solanaceae crops.",
  "Tomato___Late_blight": "Spray fungicide (metalaxyl or mancozeb) every 7 days. Remove and burn infected plants. Improve airflow by staking plants.",
  "Tomato___Leaf_Mold": "Keep greenhouse ventilated. Remove infected leaves. Spray fungicide if infection spreads.",
  "Tomato___Septoria_leaf_spot": "Remove affected leaves. Spray fungicide (chlorothalonil) every 7 to 10 days. Avoid overhead irrigation.",
  "Tomato___Spider_mites Two-spotted_spider_mite": "Spray insecticidal soap or neem oil. Keep leaves moist. Release natural predators like ladybugs.",
  "Tomato___Target_Spot": "Spray fungicide (mancozeb, chlorothalonil). Do not wet leaves at night. Rotate crops.",
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "No cure. Pull out and burn infected plants. Control whiteflies with insecticides. Plant resistant tomato varieties.",
  "Tomato___Tomato_mosaic_virus": "No cure. Use virus-free seeds. Disinfect tools and hands before touching plants. Remove sick plants immediately.",
  "Tomato___healthy": "Tomato is healthy. Water regularly, fertilize with compost, and tie plants to stakes."
}
